app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"
---
  def index
    if params[:artist_id]
      if Artist.where(:id => params[:artist_id]).empty?
        flash[:alert] = "Artist not found."
        redirect_to artists_path
      else
        @songs = Artist.find(params[:artist_id]).songs
      end
    else
      @songs = Song.all

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
---
  def show
    if params[:artist_id]
      if Song.where(:id => params[:id]).empty?
        flash[:alert] = "Song not found."
        redirect_to artist_songs_path(Artist.find(params[:artist_id]))